In [ ]:
import pandas as pd
from sklearn.preprocessing import MinMaxScaler
df = pd.read_csv("train_data.csv")
df.head()

In [2]:
duplicates = df[df.duplicated()]

print(len(duplicates))
duplicates.head()

0

Empty DataFrame
Columns: [Loan_ID, Gender, Married, Dependents, Education, Self_Employed, ApplicantIncome, CoapplicantIncome, LoanAmount, Loan_Amount_Term, Credit_History, Property_Area, Loan_Status]
Index: []

In [4]:
df.isnull().sum().sort_values(ascending=False)

Credit_History       50
Self_Employed        32
LoanAmount           22
Dependents           15
Loan_Amount_Term     14
Gender               13
Married               3
Education             0
Loan_ID               0
CoapplicantIncome     0
ApplicantIncome       0
Property_Area         0
Loan_Status           0
dtype: int64

In [7]:
## filling Credit_History value with mode
mode_credit_hist=df["Credit_History"].value_counts().idxmax()
df["Credit_History"]=df["Credit_History"].fillna(mode_credit_hist)
df["Credit_History"].isnull().sum()

np.int64(0)

In [10]:
## filling Self_Employed value with mode
mode_Self_Employed=df["Self_Employed"].value_counts().idxmax()
df["Self_Employed"]=df["Self_Employed"].fillna(mode_Self_Employed)
df["Self_Employed"].isnull().sum()

np.int64(0)

In [12]:
## filling LoanAmount value with Median
median_LoanAmount=df["LoanAmount"].median()
df["LoanAmount"]=df["LoanAmount"].fillna(median_LoanAmount)
df["LoanAmount"].isnull().sum()

np.int64(0)

In [14]:
## filling Dependents value with mode
mode_Dependents=df["Dependents"].value_counts().idxmax()
df["Dependents"]=df["Dependents"].fillna(mode_Dependents)
df["Dependents"].isnull().sum()

np.int64(0)

In [15]:
## filling Loan_Amount_Term value with Median
median_Loan_Amount_Term=df["Loan_Amount_Term"].median()
df["Loan_Amount_Term"]=df["Loan_Amount_Term"].fillna(median_Loan_Amount_Term)
df["Loan_Amount_Term"].isnull().sum()

np.int64(0)

In [16]:
## filling Gender value with mode
mode_Gender=df["Gender"].value_counts().idxmax()
df["Gender"]=df["Gender"].fillna(mode_Gender)
df["Gender"].isnull().sum()

np.int64(0)

In [17]:
## filling Married value with mode
mode_Married=df["Married"].value_counts().idxmax()
df["Married"]=df["Married"].fillna(mode_Married)
df["Married"].isnull().sum()

np.int64(0)

In [18]:
df.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [19]:
df.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,614.000000,614.000000,614.000000
mean,5403.459283,1621.245798,145.752443,342.410423,0.855049
std,6109.041673,2926.248369,84.107233,64.428629,0.352339
min,150.000000,0.000000,9.000000,12.000000,0.000000
25%,2877.500000,0.000000,100.250000,360.000000,1.000000
50%,3812.500000,1188.500000,128.000000,360.000000,1.000000
75%,5795.000000,2297.250000,164.750000,360.000000,1.000000
max,81000.000000,41667.000000,700.000000,480.000000,1.000000

In [20]:
df.describe(include="all")

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
count,614,614,614,614,614,614,614.000000,614.000000,614.000000,614.000000,614.000000,614,614
unique,614,2,2,4,2,2,NaN,NaN,NaN,NaN,NaN,3,2
top,LP001002,Male,Yes,0,Graduate,No,NaN,NaN,NaN,NaN,NaN,Semiurban,Y
freq,1,502,401,360,480,532,NaN,NaN,NaN,NaN,NaN,233,422
mean,NaN,NaN,NaN,NaN,NaN,NaN,5403.459283,1621.245798,145.752443,342.410423,0.855049,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,6109.041673,2926.248369,84.107233,64.428629,0.352339,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,150.000000,0.000000,9.000000,12.000000,0.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,2877.500000,0.000000,100.250000,360.000000,1.000000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,3812.500000,1188.500000,128.000000,360.000000,1.000000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,5795.000000,2297.250000,164.750000,360.000000,1.000000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,81000.000000,41667.000000,700.000000,480.000000,1.000000,NaN,NaN

In [ ]:
scaler = MinMaxScaler()

numerical_cols = ['ApplicantIncome', 'CoapplicantIncome', 'LoanAmount']
df[numerical_cols] = scaler.fit_transform(df[numerical_cols])

In [24]:
df.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,614.000000,614.000000,614.000000
mean,0.064978,0.038910,0.197905,342.410423,0.855049
std,0.075560,0.070229,0.121718,64.428629,0.352339
min,0.000000,0.000000,0.000000,12.000000,0.000000
25%,0.033735,0.000000,0.132055,360.000000,1.000000
50%,0.045300,0.028524,0.172214,360.000000,1.000000
75%,0.069821,0.055134,0.225398,360.000000,1.000000
max,1.000000,1.000000,1.000000,480.000000,1.000000

In [25]:
df.to_csv("cleaned_loan_data.csv", index=False)